{"config": {"layers": [{"class_name": "Conv2D", "config": {"filters": 32, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "name": "conv2d_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "batch_input_shape": [null, 28, 28, 1], "use_bias": true, "padding": "valid", "trainable": true, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"filters": 64, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_2", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "padding": "valid", "trainable": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 128, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 10, "activation": "softmax", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_2", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null}}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.3", "backend": "tensorflow"}